Microchip-MPLAB-Harmony/reference_apps/apps/sam_e51_cnano/same51n_mikroe_click/wifi_7/firmware/src/packs/ATSAME51J20A_DFP/component/can.h
/* -------- CAN_TXESC : (CAN Offset: 0xC8) (R/W 32) Tx Buffer Element Size Configuration -------- */
#define CAN_TXESC_RESETVALUE                  _U_(0x00)                                            /**<  (CAN_TXESC) Tx Buffer Element Size Configuration  Reset Value */

#define CAN_TXESC_TBDS_Pos                    _U_(0)                                               /**< (CAN_TXESC) Tx Buffer Data Field Size Position */
#define CAN_TXESC_TBDS_Msk                    (_U_(0x7) << CAN_TXESC_TBDS_Pos)                     /**< (CAN_TXESC) Tx Buffer Data Field Size Mask */
#define CAN_TXESC_TBDS(value)                 (CAN_TXESC_TBDS_Msk & ((value) << CAN_TXESC_TBDS_Pos))
#define   CAN_TXESC_TBDS_DATA8_Val            _U_(0x0)                                             /**< (CAN_TXESC) 8 byte data field  */
#define   CAN_TXESC_TBDS_DATA12_Val           _U_(0x1)                                             /**< (CAN_TXESC) 12 byte data field  */
#define   CAN_TXESC_TBDS_DATA16_Val           _U_(0x2)                                             /**< (CAN_TXESC) 16 byte data field  */
#define   CAN_TXESC_TBDS_DATA20_Val           _U_(0x3)                                             /**< (CAN_TXESC) 20 byte data field  */
#define   CAN_TXESC_TBDS_DATA24_Val           _U_(0x4)                                             /**< (CAN_TXESC) 24 byte data field  */
#define   CAN_TXESC_TBDS_DATA32_Val           _U_(0x5)                                             /**< (CAN_TXESC) 32 byte data field  */
#define   CAN_TXESC_TBDS_DATA48_Val           _U_(0x6)                                             /**< (CAN_TXESC) 48 byte data field  */
#define   CAN_TXESC_TBDS_DATA64_Val           _U_(0x7)                                             /**< (CAN_TXESC) 64 byte data field  */
#define CAN_TXESC_TBDS_DATA8                  (CAN_TXESC_TBDS_DATA8_Val << CAN_TXESC_TBDS_Pos)     /**< (CAN_TXESC) 8 byte data field Position  */
#define CAN_TXESC_TBDS_DATA12                 (CAN_TXESC_TBDS_DATA12_Val << CAN_TXESC_TBDS_Pos)    /**< (CAN_TXESC) 12 byte data field Position  */
#define CAN_TXESC_TBDS_DATA16                 (CAN_TXESC_TBDS_DATA16_Val << CAN_TXESC_TBDS_Pos)    /**< (CAN_TXESC) 16 byte data field Position  */
#define CAN_TXESC_TBDS_DATA20                 (CAN_TXESC_TBDS_DATA20_Val << CAN_TXESC_TBDS_Pos)    /**< (CAN_TXESC) 20 byte data field Position  */
#define CAN_TXESC_TBDS_DATA24                 (CAN_TXESC_TBDS_DATA24_Val << CAN_TXESC_TBDS_Pos)    /**< (CAN_TXESC) 24 byte data field Position  */
#define CAN_TXESC_TBDS_DATA32                 (CAN_TXESC_TBDS_DATA32_Val << CAN_TXESC_TBDS_Pos)    /**< (CAN_TXESC) 32 byte data field Position  */
#define CAN_TXESC_TBDS_DATA48                 (CAN_TXESC_TBDS_DATA48_Val << CAN_TXESC_TBDS_Pos)    /**< (CAN_TXESC) 48 byte data field Position  */
#define CAN_TXESC_TBDS_DATA64                 (CAN_TXESC_TBDS_DATA64_Val << CAN_TXESC_TBDS_Pos)    /**< (CAN_TXESC) 64 byte data field Position  */
#define CAN_TXESC_Msk                         _U_(0x00000007)                                      /**< (CAN_TXESC) Register Mask  */


/* -------- CAN_TXBRP : (CAN Offset: 0xCC) ( R/ 32) Tx Buffer Request Pending -------- */
#define CAN_TXBRP_RESETVALUE                  _U_(0x00)                                            /**<  (CAN_TXBRP) Tx Buffer Request Pending  Reset Value */

#define CAN_TXBRP_TRP0_Pos                    _U_(0)                                               /**< (CAN_TXBRP) Transmission Request Pending 0 Position */
#define CAN_TXBRP_TRP0_Msk                    (_U_(0x1) << CAN_TXBRP_TRP0_Pos)                     /**< (CAN_TXBRP) Transmission Request Pending 0 Mask */
#define CAN_TXBRP_TRP0(value)                 (CAN_TXBRP_TRP0_Msk & ((value) << CAN_TXBRP_TRP0_Pos))
#define CAN_TXBRP_TRP1_Pos                    _U_(1)                                               /**< (CAN_TXBRP) Transmission Request Pending 1 Position */
#define CAN_TXBRP_TRP1_Msk                    (_U_(0x1) << CAN_TXBRP_TRP1_Pos)                     /**< (CAN_TXBRP) Transmission Request Pending 1 Mask */
#define CAN_TXBRP_TRP1(value)                 (CAN_TXBRP_TRP1_Msk & ((value) << CAN_TXBRP_TRP1_Pos))
#define CAN_TXBRP_TRP2_Pos                    _U_(2)                                               /**< (CAN_TXBRP) Transmission Request Pending 2 Position */
#define CAN_TXBRP_TRP2_Msk                    (_U_(0x1) << CAN_TXBRP_TRP2_Pos)                     /**< (CAN_TXBRP) Transmission Request Pending 2 Mask */
#define CAN_TXBRP_TRP2(value)                 (CAN_TXBRP_TRP2_Msk & ((value) << CAN_TXBRP_TRP2_Pos))
#define CAN_TXBRP_TRP3_Pos                    _U_(3)                                               /**< (CAN_TXBRP) Transmission Request Pending 3 Position */
#define CAN_TXBRP_TRP3_Msk                    (_U_(0x1) << CAN_TXBRP_TRP3_Pos)                     /**< (CAN_TXBRP) Transmission Request Pending 3 Mask */
#define CAN_TXBRP_TRP3(value)                 (CAN_TXBRP_TRP3_Msk & ((value) << CAN_TXBRP_TRP3_Pos))
#define CAN_TXBRP_TRP4_Pos                    _U_(4)                                               /**< (CAN_TXBRP) Transmission Request Pending 4 Position */
#define CAN_TXBRP_TRP4_Msk                    (_U_(0x1) << CAN_TXBRP_TRP4_Pos)                     /**< (CAN_TXBRP) Transmission Request Pending 4 Mask */
#define CAN_TXBRP_TRP4(value)                 (CAN_TXBRP_TRP4_Msk & ((value) << CAN_TXBRP_TRP4_Pos))
#define CAN_TXBRP_TRP5_Pos                    _U_(5)                                               /**< (CAN_TXBRP) Transmission Request Pending 5 Position */
#define CAN_TXBRP_TRP5_Msk                    (_U_(0x1) << CAN_TXBRP_TRP5_Pos)                     /**< (CAN_TXBRP) Transmission Request Pending 5 Mask */
#define CAN_TXBRP_TRP5(value)                 (CAN_TXBRP_TRP5_Msk & ((value) << CAN_TXBRP_TRP5_Pos))
#define CAN_TXBRP_TRP6_Pos                    _U_(6)                                               /**< (CAN_TXBRP) Transmission Request Pending 6 Position */
#define CAN_TXBRP_TRP6_Msk                    (_U_(0x1) << CAN_TXBRP_TRP6_Pos)                     /**< (CAN_TXBRP) Transmission Request Pending 6 Mask */
#define CAN_TXBRP_TRP6(value)                 (CAN_TXBRP_TRP6_Msk & ((value) << CAN_TXBRP_TRP6_Pos))
#define CAN_TXBRP_TRP7_Pos                    _U_(7)                                               /**< (CAN_TXBRP) Transmission Request Pending 7 Position */
#define CAN_TXBRP_TRP7_Msk                    (_U_(0x1) << CAN_TXBRP_TRP7_Pos)                     /**< (CAN_TXBRP) Transmission Request Pending 7 Mask */
#define CAN_TXBRP_TRP7(value)                 (CAN_TXBRP_TRP7_Msk & ((value) << CAN_TXBRP_TRP7_Pos))
#define CAN_TXBRP_TRP8_Pos                    _U_(8)                                               /**< (CAN_TXBRP) Transmission Request Pending 8 Position */
#define CAN_TXBRP_TRP8_Msk                    (_U_(0x1) << CAN_TXBRP_TRP8_Pos)                     /**< (CAN_TXBRP) Transmission Request Pending 8 Mask */
#define CAN_TXBRP_TRP8(value)                 (CAN_TXBRP_TRP8_Msk & ((value) << CAN_TXBRP_TRP8_Pos))
#define CAN_TXBRP_TRP9_Pos                    _U_(9)                                               /**< (CAN_TXBRP) Transmission Request Pending 9 Position */
#define CAN_TXBRP_TRP9_Msk                    (_U_(0x1) << CAN_TXBRP_TRP9_Pos)                     /**< (CAN_TXBRP) Transmission Request Pending 9 Mask */
#define CAN_TXBRP_TRP9(value)                 (CAN_TXBRP_TRP9_Msk & ((value) << CAN_TXBRP_TRP9_Pos))
#define CAN_TXBRP_TRP10_Pos                   _U_(10)                                              /**< (CAN_TXBRP) Transmission Request Pending 10 Position */
#define CAN_TXBRP_TRP10_Msk                   (_U_(0x1) << CAN_TXBRP_TRP10_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 10 Mask */
#define CAN_TXBRP_TRP10(value)                (CAN_TXBRP_TRP10_Msk & ((value) << CAN_TXBRP_TRP10_Pos))
#define CAN_TXBRP_TRP11_Pos                   _U_(11)                                              /**< (CAN_TXBRP) Transmission Request Pending 11 Position */
#define CAN_TXBRP_TRP11_Msk                   (_U_(0x1) << CAN_TXBRP_TRP11_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 11 Mask */
#define CAN_TXBRP_TRP11(value)                (CAN_TXBRP_TRP11_Msk & ((value) << CAN_TXBRP_TRP11_Pos))
#define CAN_TXBRP_TRP12_Pos                   _U_(12)                                              /**< (CAN_TXBRP) Transmission Request Pending 12 Position */
#define CAN_TXBRP_TRP12_Msk                   (_U_(0x1) << CAN_TXBRP_TRP12_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 12 Mask */
#define CAN_TXBRP_TRP12(value)                (CAN_TXBRP_TRP12_Msk & ((value) << CAN_TXBRP_TRP12_Pos))
#define CAN_TXBRP_TRP13_Pos                   _U_(13)                                              /**< (CAN_TXBRP) Transmission Request Pending 13 Position */
#define CAN_TXBRP_TRP13_Msk                   (_U_(0x1) << CAN_TXBRP_TRP13_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 13 Mask */
#define CAN_TXBRP_TRP13(value)                (CAN_TXBRP_TRP13_Msk & ((value) << CAN_TXBRP_TRP13_Pos))
#define CAN_TXBRP_TRP14_Pos                   _U_(14)                                              /**< (CAN_TXBRP) Transmission Request Pending 14 Position */
#define CAN_TXBRP_TRP14_Msk                   (_U_(0x1) << CAN_TXBRP_TRP14_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 14 Mask */
#define CAN_TXBRP_TRP14(value)                (CAN_TXBRP_TRP14_Msk & ((value) << CAN_TXBRP_TRP14_Pos))
#define CAN_TXBRP_TRP15_Pos                   _U_(15)                                              /**< (CAN_TXBRP) Transmission Request Pending 15 Position */
#define CAN_TXBRP_TRP15_Msk                   (_U_(0x1) << CAN_TXBRP_TRP15_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 15 Mask */
#define CAN_TXBRP_TRP15(value)                (CAN_TXBRP_TRP15_Msk & ((value) << CAN_TXBRP_TRP15_Pos))
#define CAN_TXBRP_TRP16_Pos                   _U_(16)                                              /**< (CAN_TXBRP) Transmission Request Pending 16 Position */
#define CAN_TXBRP_TRP16_Msk                   (_U_(0x1) << CAN_TXBRP_TRP16_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 16 Mask */
#define CAN_TXBRP_TRP16(value)                (CAN_TXBRP_TRP16_Msk & ((value) << CAN_TXBRP_TRP16_Pos))
#define CAN_TXBRP_TRP17_Pos                   _U_(17)                                              /**< (CAN_TXBRP) Transmission Request Pending 17 Position */
#define CAN_TXBRP_TRP17_Msk                   (_U_(0x1) << CAN_TXBRP_TRP17_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 17 Mask */
#define CAN_TXBRP_TRP17(value)                (CAN_TXBRP_TRP17_Msk & ((value) << CAN_TXBRP_TRP17_Pos))
#define CAN_TXBRP_TRP18_Pos                   _U_(18)                                              /**< (CAN_TXBRP) Transmission Request Pending 18 Position */
#define CAN_TXBRP_TRP18_Msk                   (_U_(0x1) << CAN_TXBRP_TRP18_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 18 Mask */
#define CAN_TXBRP_TRP18(value)                (CAN_TXBRP_TRP18_Msk & ((value) << CAN_TXBRP_TRP18_Pos))
#define CAN_TXBRP_TRP19_Pos                   _U_(19)                                              /**< (CAN_TXBRP) Transmission Request Pending 19 Position */
#define CAN_TXBRP_TRP19_Msk                   (_U_(0x1) << CAN_TXBRP_TRP19_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 19 Mask */
#define CAN_TXBRP_TRP19(value)                (CAN_TXBRP_TRP19_Msk & ((value) << CAN_TXBRP_TRP19_Pos))
#define CAN_TXBRP_TRP20_Pos                   _U_(20)                                              /**< (CAN_TXBRP) Transmission Request Pending 20 Position */
#define CAN_TXBRP_TRP20_Msk                   (_U_(0x1) << CAN_TXBRP_TRP20_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 20 Mask */
#define CAN_TXBRP_TRP20(value)                (CAN_TXBRP_TRP20_Msk & ((value) << CAN_TXBRP_TRP20_Pos))
#define CAN_TXBRP_TRP21_Pos                   _U_(21)                                              /**< (CAN_TXBRP) Transmission Request Pending 21 Position */
#define CAN_TXBRP_TRP21_Msk                   (_U_(0x1) << CAN_TXBRP_TRP21_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 21 Mask */
#define CAN_TXBRP_TRP21(value)                (CAN_TXBRP_TRP21_Msk & ((value) << CAN_TXBRP_TRP21_Pos))
#define CAN_TXBRP_TRP22_Pos                   _U_(22)                                              /**< (CAN_TXBRP) Transmission Request Pending 22 Position */
#define CAN_TXBRP_TRP22_Msk                   (_U_(0x1) << CAN_TXBRP_TRP22_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 22 Mask */
#define CAN_TXBRP_TRP22(value)                (CAN_TXBRP_TRP22_Msk & ((value) << CAN_TXBRP_TRP22_Pos))
#define CAN_TXBRP_TRP23_Pos                   _U_(23)                                              /**< (CAN_TXBRP) Transmission Request Pending 23 Position */
#define CAN_TXBRP_TRP23_Msk                   (_U_(0x1) << CAN_TXBRP_TRP23_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 23 Mask */
#define CAN_TXBRP_TRP23(value)                (CAN_TXBRP_TRP23_Msk & ((value) << CAN_TXBRP_TRP23_Pos))
#define CAN_TXBRP_TRP24_Pos                   _U_(24)                                              /**< (CAN_TXBRP) Transmission Request Pending 24 Position */
#define CAN_TXBRP_TRP24_Msk                   (_U_(0x1) << CAN_TXBRP_TRP24_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 24 Mask */
#define CAN_TXBRP_TRP24(value)                (CAN_TXBRP_TRP24_Msk & ((value) << CAN_TXBRP_TRP24_Pos))
#define CAN_TXBRP_TRP25_Pos                   _U_(25)                                              /**< (CAN_TXBRP) Transmission Request Pending 25 Position */
#define CAN_TXBRP_TRP25_Msk                   (_U_(0x1) << CAN_TXBRP_TRP25_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 25 Mask */
#define CAN_TXBRP_TRP25(value)                (CAN_TXBRP_TRP25_Msk & ((value) << CAN_TXBRP_TRP25_Pos))
#define CAN_TXBRP_TRP26_Pos                   _U_(26)                                              /**< (CAN_TXBRP) Transmission Request Pending 26 Position */
#define CAN_TXBRP_TRP26_Msk                   (_U_(0x1) << CAN_TXBRP_TRP26_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 26 Mask */
#define CAN_TXBRP_TRP26(value)                (CAN_TXBRP_TRP26_Msk & ((value) << CAN_TXBRP_TRP26_Pos))
#define CAN_TXBRP_TRP27_Pos                   _U_(27)                                              /**< (CAN_TXBRP) Transmission Request Pending 27 Position */
#define CAN_TXBRP_TRP27_Msk                   (_U_(0x1) << CAN_TXBRP_TRP27_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 27 Mask */
#define CAN_TXBRP_TRP27(value)                (CAN_TXBRP_TRP27_Msk & ((value) << CAN_TXBRP_TRP27_Pos))
#define CAN_TXBRP_TRP28_Pos                   _U_(28)                                              /**< (CAN_TXBRP) Transmission Request Pending 28 Position */
#define CAN_TXBRP_TRP28_Msk                   (_U_(0x1) << CAN_TXBRP_TRP28_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 28 Mask */
#define CAN_TXBRP_TRP28(value)                (CAN_TXBRP_TRP28_Msk & ((value) << CAN_TXBRP_TRP28_Pos))
#define CAN_TXBRP_TRP29_Pos                   _U_(29)                                              /**< (CAN_TXBRP) Transmission Request Pending 29 Position */
#define CAN_TXBRP_TRP29_Msk                   (_U_(0x1) << CAN_TXBRP_TRP29_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 29 Mask */
#define CAN_TXBRP_TRP29(value)                (CAN_TXBRP_TRP29_Msk & ((value) << CAN_TXBRP_TRP29_Pos))
#define CAN_TXBRP_TRP30_Pos                   _U_(30)                                              /**< (CAN_TXBRP) Transmission Request Pending 30 Position */
#define CAN_TXBRP_TRP30_Msk                   (_U_(0x1) << CAN_TXBRP_TRP30_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 30 Mask */
#define CAN_TXBRP_TRP30(value)                (CAN_TXBRP_TRP30_Msk & ((value) << CAN_TXBRP_TRP30_Pos))
#define CAN_TXBRP_TRP31_Pos                   _U_(31)                                              /**< (CAN_TXBRP) Transmission Request Pending 31 Position */
#define CAN_TXBRP_TRP31_Msk                   (_U_(0x1) << CAN_TXBRP_TRP31_Pos)                    /**< (CAN_TXBRP) Transmission Request Pending 31 Mask */
#define CAN_TXBRP_TRP31(value)                (CAN_TXBRP_TRP31_Msk & ((value) << CAN_TXBRP_TRP31_Pos))
#define CAN_TXBRP_Msk                         _U_(0xFFFFFFFF)                                      /**< (CAN_TXBRP) Register Mask  */

#define CAN_TXBRP_TRP_Pos                     _U_(0)                                               /**< (CAN_TXBRP Position) Transmission Request Pending 3x */
#define CAN_TXBRP_TRP_Msk                     (_U_(0xFFFFFFFF) << CAN_TXBRP_TRP_Pos)               /**< (CAN_TXBRP Mask) TRP */
#define CAN_TXBRP_TRP(value)                  (CAN_TXBRP_TRP_Msk & ((value) << CAN_TXBRP_TRP_Pos)) 

/* -------- CAN_TXBAR : (CAN Offset: 0xD0) (R/W 32) Tx Buffer Add Request -------- */
#define CAN_TXBAR_RESETVALUE                  _U_(0x00)                                            /**<  (CAN_TXBAR) Tx Buffer Add Request  Reset Value */

