Microchip-MPLAB-Harmony/reference_apps/apps/sam_e51_cnano/same51n_mikroe_click/wifi_7/firmware/src/packs/ATSAME51J20A_DFP/component/can.h
#define CAN_TXBAR_AR_Pos                      _U_(0)                                               /**< (CAN_TXBAR Position) Add Request 3x */
#define CAN_TXBAR_AR_Msk                      (_U_(0xFFFFFFFF) << CAN_TXBAR_AR_Pos)                /**< (CAN_TXBAR Mask) AR */
#define CAN_TXBAR_AR(value)                   (CAN_TXBAR_AR_Msk & ((value) << CAN_TXBAR_AR_Pos))   

/* -------- CAN_TXBCR : (CAN Offset: 0xD4) (R/W 32) Tx Buffer Cancellation Request -------- */
#define CAN_TXBCR_RESETVALUE                  _U_(0x00)                                            /**<  (CAN_TXBCR) Tx Buffer Cancellation Request  Reset Value */

#define CAN_TXBCR_CR0_Pos                     _U_(0)                                               /**< (CAN_TXBCR) Cancellation Request 0 Position */
#define CAN_TXBCR_CR0_Msk                     (_U_(0x1) << CAN_TXBCR_CR0_Pos)                      /**< (CAN_TXBCR) Cancellation Request 0 Mask */
#define CAN_TXBCR_CR0(value)                  (CAN_TXBCR_CR0_Msk & ((value) << CAN_TXBCR_CR0_Pos))
#define CAN_TXBCR_CR1_Pos                     _U_(1)                                               /**< (CAN_TXBCR) Cancellation Request 1 Position */
#define CAN_TXBCR_CR1_Msk                     (_U_(0x1) << CAN_TXBCR_CR1_Pos)                      /**< (CAN_TXBCR) Cancellation Request 1 Mask */
#define CAN_TXBCR_CR1(value)                  (CAN_TXBCR_CR1_Msk & ((value) << CAN_TXBCR_CR1_Pos))
#define CAN_TXBCR_CR2_Pos                     _U_(2)                                               /**< (CAN_TXBCR) Cancellation Request 2 Position */
#define CAN_TXBCR_CR2_Msk                     (_U_(0x1) << CAN_TXBCR_CR2_Pos)                      /**< (CAN_TXBCR) Cancellation Request 2 Mask */
#define CAN_TXBCR_CR2(value)                  (CAN_TXBCR_CR2_Msk & ((value) << CAN_TXBCR_CR2_Pos))
#define CAN_TXBCR_CR3_Pos                     _U_(3)                                               /**< (CAN_TXBCR) Cancellation Request 3 Position */
#define CAN_TXBCR_CR3_Msk                     (_U_(0x1) << CAN_TXBCR_CR3_Pos)                      /**< (CAN_TXBCR) Cancellation Request 3 Mask */
#define CAN_TXBCR_CR3(value)                  (CAN_TXBCR_CR3_Msk & ((value) << CAN_TXBCR_CR3_Pos))
#define CAN_TXBCR_CR4_Pos                     _U_(4)                                               /**< (CAN_TXBCR) Cancellation Request 4 Position */
#define CAN_TXBCR_CR4_Msk                     (_U_(0x1) << CAN_TXBCR_CR4_Pos)                      /**< (CAN_TXBCR) Cancellation Request 4 Mask */
#define CAN_TXBCR_CR4(value)                  (CAN_TXBCR_CR4_Msk & ((value) << CAN_TXBCR_CR4_Pos))
#define CAN_TXBCR_CR5_Pos                     _U_(5)                                               /**< (CAN_TXBCR) Cancellation Request 5 Position */
#define CAN_TXBCR_CR5_Msk                     (_U_(0x1) << CAN_TXBCR_CR5_Pos)                      /**< (CAN_TXBCR) Cancellation Request 5 Mask */
#define CAN_TXBCR_CR5(value)                  (CAN_TXBCR_CR5_Msk & ((value) << CAN_TXBCR_CR5_Pos))
#define CAN_TXBCR_CR6_Pos                     _U_(6)                                               /**< (CAN_TXBCR) Cancellation Request 6 Position */
#define CAN_TXBCR_CR6_Msk                     (_U_(0x1) << CAN_TXBCR_CR6_Pos)                      /**< (CAN_TXBCR) Cancellation Request 6 Mask */
#define CAN_TXBCR_CR6(value)                  (CAN_TXBCR_CR6_Msk & ((value) << CAN_TXBCR_CR6_Pos))
#define CAN_TXBCR_CR7_Pos                     _U_(7)                                               /**< (CAN_TXBCR) Cancellation Request 7 Position */
#define CAN_TXBCR_CR7_Msk                     (_U_(0x1) << CAN_TXBCR_CR7_Pos)                      /**< (CAN_TXBCR) Cancellation Request 7 Mask */
#define CAN_TXBCR_CR7(value)                  (CAN_TXBCR_CR7_Msk & ((value) << CAN_TXBCR_CR7_Pos))
#define CAN_TXBCR_CR8_Pos                     _U_(8)                                               /**< (CAN_TXBCR) Cancellation Request 8 Position */
#define CAN_TXBCR_CR8_Msk                     (_U_(0x1) << CAN_TXBCR_CR8_Pos)                      /**< (CAN_TXBCR) Cancellation Request 8 Mask */
#define CAN_TXBCR_CR8(value)                  (CAN_TXBCR_CR8_Msk & ((value) << CAN_TXBCR_CR8_Pos))
#define CAN_TXBCR_CR9_Pos                     _U_(9)                                               /**< (CAN_TXBCR) Cancellation Request 9 Position */
#define CAN_TXBCR_CR9_Msk                     (_U_(0x1) << CAN_TXBCR_CR9_Pos)                      /**< (CAN_TXBCR) Cancellation Request 9 Mask */
#define CAN_TXBCR_CR9(value)                  (CAN_TXBCR_CR9_Msk & ((value) << CAN_TXBCR_CR9_Pos))
#define CAN_TXBCR_CR10_Pos                    _U_(10)                                              /**< (CAN_TXBCR) Cancellation Request 10 Position */
#define CAN_TXBCR_CR10_Msk                    (_U_(0x1) << CAN_TXBCR_CR10_Pos)                     /**< (CAN_TXBCR) Cancellation Request 10 Mask */
#define CAN_TXBCR_CR10(value)                 (CAN_TXBCR_CR10_Msk & ((value) << CAN_TXBCR_CR10_Pos))
#define CAN_TXBCR_CR11_Pos                    _U_(11)                                              /**< (CAN_TXBCR) Cancellation Request 11 Position */
#define CAN_TXBCR_CR11_Msk                    (_U_(0x1) << CAN_TXBCR_CR11_Pos)                     /**< (CAN_TXBCR) Cancellation Request 11 Mask */
#define CAN_TXBCR_CR11(value)                 (CAN_TXBCR_CR11_Msk & ((value) << CAN_TXBCR_CR11_Pos))
#define CAN_TXBCR_CR12_Pos                    _U_(12)                                              /**< (CAN_TXBCR) Cancellation Request 12 Position */
#define CAN_TXBCR_CR12_Msk                    (_U_(0x1) << CAN_TXBCR_CR12_Pos)                     /**< (CAN_TXBCR) Cancellation Request 12 Mask */
#define CAN_TXBCR_CR12(value)                 (CAN_TXBCR_CR12_Msk & ((value) << CAN_TXBCR_CR12_Pos))
#define CAN_TXBCR_CR13_Pos                    _U_(13)                                              /**< (CAN_TXBCR) Cancellation Request 13 Position */
#define CAN_TXBCR_CR13_Msk                    (_U_(0x1) << CAN_TXBCR_CR13_Pos)                     /**< (CAN_TXBCR) Cancellation Request 13 Mask */
#define CAN_TXBCR_CR13(value)                 (CAN_TXBCR_CR13_Msk & ((value) << CAN_TXBCR_CR13_Pos))
#define CAN_TXBCR_CR14_Pos                    _U_(14)                                              /**< (CAN_TXBCR) Cancellation Request 14 Position */
#define CAN_TXBCR_CR14_Msk                    (_U_(0x1) << CAN_TXBCR_CR14_Pos)                     /**< (CAN_TXBCR) Cancellation Request 14 Mask */
#define CAN_TXBCR_CR14(value)                 (CAN_TXBCR_CR14_Msk & ((value) << CAN_TXBCR_CR14_Pos))
#define CAN_TXBCR_CR15_Pos                    _U_(15)                                              /**< (CAN_TXBCR) Cancellation Request 15 Position */
#define CAN_TXBCR_CR15_Msk                    (_U_(0x1) << CAN_TXBCR_CR15_Pos)                     /**< (CAN_TXBCR) Cancellation Request 15 Mask */
#define CAN_TXBCR_CR15(value)                 (CAN_TXBCR_CR15_Msk & ((value) << CAN_TXBCR_CR15_Pos))
#define CAN_TXBCR_CR16_Pos                    _U_(16)                                              /**< (CAN_TXBCR) Cancellation Request 16 Position */
#define CAN_TXBCR_CR16_Msk                    (_U_(0x1) << CAN_TXBCR_CR16_Pos)                     /**< (CAN_TXBCR) Cancellation Request 16 Mask */
#define CAN_TXBCR_CR16(value)                 (CAN_TXBCR_CR16_Msk & ((value) << CAN_TXBCR_CR16_Pos))
#define CAN_TXBCR_CR17_Pos                    _U_(17)                                              /**< (CAN_TXBCR) Cancellation Request 17 Position */
#define CAN_TXBCR_CR17_Msk                    (_U_(0x1) << CAN_TXBCR_CR17_Pos)                     /**< (CAN_TXBCR) Cancellation Request 17 Mask */
#define CAN_TXBCR_CR17(value)                 (CAN_TXBCR_CR17_Msk & ((value) << CAN_TXBCR_CR17_Pos))
#define CAN_TXBCR_CR18_Pos                    _U_(18)                                              /**< (CAN_TXBCR) Cancellation Request 18 Position */
#define CAN_TXBCR_CR18_Msk                    (_U_(0x1) << CAN_TXBCR_CR18_Pos)                     /**< (CAN_TXBCR) Cancellation Request 18 Mask */
#define CAN_TXBCR_CR18(value)                 (CAN_TXBCR_CR18_Msk & ((value) << CAN_TXBCR_CR18_Pos))
#define CAN_TXBCR_CR19_Pos                    _U_(19)                                              /**< (CAN_TXBCR) Cancellation Request 19 Position */
#define CAN_TXBCR_CR19_Msk                    (_U_(0x1) << CAN_TXBCR_CR19_Pos)                     /**< (CAN_TXBCR) Cancellation Request 19 Mask */
#define CAN_TXBCR_CR19(value)                 (CAN_TXBCR_CR19_Msk & ((value) << CAN_TXBCR_CR19_Pos))
#define CAN_TXBCR_CR20_Pos                    _U_(20)                                              /**< (CAN_TXBCR) Cancellation Request 20 Position */
#define CAN_TXBCR_CR20_Msk                    (_U_(0x1) << CAN_TXBCR_CR20_Pos)                     /**< (CAN_TXBCR) Cancellation Request 20 Mask */
#define CAN_TXBCR_CR20(value)                 (CAN_TXBCR_CR20_Msk & ((value) << CAN_TXBCR_CR20_Pos))
#define CAN_TXBCR_CR21_Pos                    _U_(21)                                              /**< (CAN_TXBCR) Cancellation Request 21 Position */
#define CAN_TXBCR_CR21_Msk                    (_U_(0x1) << CAN_TXBCR_CR21_Pos)                     /**< (CAN_TXBCR) Cancellation Request 21 Mask */
#define CAN_TXBCR_CR21(value)                 (CAN_TXBCR_CR21_Msk & ((value) << CAN_TXBCR_CR21_Pos))
#define CAN_TXBCR_CR22_Pos                    _U_(22)                                              /**< (CAN_TXBCR) Cancellation Request 22 Position */
#define CAN_TXBCR_CR22_Msk                    (_U_(0x1) << CAN_TXBCR_CR22_Pos)                     /**< (CAN_TXBCR) Cancellation Request 22 Mask */
#define CAN_TXBCR_CR22(value)                 (CAN_TXBCR_CR22_Msk & ((value) << CAN_TXBCR_CR22_Pos))
#define CAN_TXBCR_CR23_Pos                    _U_(23)                                              /**< (CAN_TXBCR) Cancellation Request 23 Position */
#define CAN_TXBCR_CR23_Msk                    (_U_(0x1) << CAN_TXBCR_CR23_Pos)                     /**< (CAN_TXBCR) Cancellation Request 23 Mask */
#define CAN_TXBCR_CR23(value)                 (CAN_TXBCR_CR23_Msk & ((value) << CAN_TXBCR_CR23_Pos))
#define CAN_TXBCR_CR24_Pos                    _U_(24)                                              /**< (CAN_TXBCR) Cancellation Request 24 Position */
#define CAN_TXBCR_CR24_Msk                    (_U_(0x1) << CAN_TXBCR_CR24_Pos)                     /**< (CAN_TXBCR) Cancellation Request 24 Mask */
#define CAN_TXBCR_CR24(value)                 (CAN_TXBCR_CR24_Msk & ((value) << CAN_TXBCR_CR24_Pos))
#define CAN_TXBCR_CR25_Pos                    _U_(25)                                              /**< (CAN_TXBCR) Cancellation Request 25 Position */
#define CAN_TXBCR_CR25_Msk                    (_U_(0x1) << CAN_TXBCR_CR25_Pos)                     /**< (CAN_TXBCR) Cancellation Request 25 Mask */
#define CAN_TXBCR_CR25(value)                 (CAN_TXBCR_CR25_Msk & ((value) << CAN_TXBCR_CR25_Pos))
#define CAN_TXBCR_CR26_Pos                    _U_(26)                                              /**< (CAN_TXBCR) Cancellation Request 26 Position */
#define CAN_TXBCR_CR26_Msk                    (_U_(0x1) << CAN_TXBCR_CR26_Pos)                     /**< (CAN_TXBCR) Cancellation Request 26 Mask */
#define CAN_TXBCR_CR26(value)                 (CAN_TXBCR_CR26_Msk & ((value) << CAN_TXBCR_CR26_Pos))
#define CAN_TXBCR_CR27_Pos                    _U_(27)                                              /**< (CAN_TXBCR) Cancellation Request 27 Position */
#define CAN_TXBCR_CR27_Msk                    (_U_(0x1) << CAN_TXBCR_CR27_Pos)                     /**< (CAN_TXBCR) Cancellation Request 27 Mask */
#define CAN_TXBCR_CR27(value)                 (CAN_TXBCR_CR27_Msk & ((value) << CAN_TXBCR_CR27_Pos))
#define CAN_TXBCR_CR28_Pos                    _U_(28)                                              /**< (CAN_TXBCR) Cancellation Request 28 Position */
#define CAN_TXBCR_CR28_Msk                    (_U_(0x1) << CAN_TXBCR_CR28_Pos)                     /**< (CAN_TXBCR) Cancellation Request 28 Mask */
#define CAN_TXBCR_CR28(value)                 (CAN_TXBCR_CR28_Msk & ((value) << CAN_TXBCR_CR28_Pos))
#define CAN_TXBCR_CR29_Pos                    _U_(29)                                              /**< (CAN_TXBCR) Cancellation Request 29 Position */
#define CAN_TXBCR_CR29_Msk                    (_U_(0x1) << CAN_TXBCR_CR29_Pos)                     /**< (CAN_TXBCR) Cancellation Request 29 Mask */
#define CAN_TXBCR_CR29(value)                 (CAN_TXBCR_CR29_Msk & ((value) << CAN_TXBCR_CR29_Pos))
#define CAN_TXBCR_CR30_Pos                    _U_(30)                                              /**< (CAN_TXBCR) Cancellation Request 30 Position */
#define CAN_TXBCR_CR30_Msk                    (_U_(0x1) << CAN_TXBCR_CR30_Pos)                     /**< (CAN_TXBCR) Cancellation Request 30 Mask */
#define CAN_TXBCR_CR30(value)                 (CAN_TXBCR_CR30_Msk & ((value) << CAN_TXBCR_CR30_Pos))
#define CAN_TXBCR_CR31_Pos                    _U_(31)                                              /**< (CAN_TXBCR) Cancellation Request 31 Position */
#define CAN_TXBCR_CR31_Msk                    (_U_(0x1) << CAN_TXBCR_CR31_Pos)                     /**< (CAN_TXBCR) Cancellation Request 31 Mask */
#define CAN_TXBCR_CR31(value)                 (CAN_TXBCR_CR31_Msk & ((value) << CAN_TXBCR_CR31_Pos))
#define CAN_TXBCR_Msk                         _U_(0xFFFFFFFF)                                      /**< (CAN_TXBCR) Register Mask  */

