Microchip-MPLAB-Harmony/reference_apps/apps/sam_e51_cnano/same51n_mikroe_click/wifi_7/firmware/src/packs/ATSAME51J20A_DFP/component/can.h
#define CAN_TXBCR_CR_Pos                      _U_(0)                                               /**< (CAN_TXBCR Position) Cancellation Request 3x */
#define CAN_TXBCR_CR_Msk                      (_U_(0xFFFFFFFF) << CAN_TXBCR_CR_Pos)                /**< (CAN_TXBCR Mask) CR */
#define CAN_TXBCR_CR(value)                   (CAN_TXBCR_CR_Msk & ((value) << CAN_TXBCR_CR_Pos))   

/* -------- CAN_TXBTO : (CAN Offset: 0xD8) ( R/ 32) Tx Buffer Transmission Occurred -------- */
#define CAN_TXBTO_RESETVALUE                  _U_(0x00)                                            /**<  (CAN_TXBTO) Tx Buffer Transmission Occurred  Reset Value */

#define CAN_TXBTO_TO0_Pos                     _U_(0)                                               /**< (CAN_TXBTO) Transmission Occurred 0 Position */
#define CAN_TXBTO_TO0_Msk                     (_U_(0x1) << CAN_TXBTO_TO0_Pos)                      /**< (CAN_TXBTO) Transmission Occurred 0 Mask */
#define CAN_TXBTO_TO0(value)                  (CAN_TXBTO_TO0_Msk & ((value) << CAN_TXBTO_TO0_Pos))
#define CAN_TXBTO_TO1_Pos                     _U_(1)                                               /**< (CAN_TXBTO) Transmission Occurred 1 Position */
#define CAN_TXBTO_TO1_Msk                     (_U_(0x1) << CAN_TXBTO_TO1_Pos)                      /**< (CAN_TXBTO) Transmission Occurred 1 Mask */
#define CAN_TXBTO_TO1(value)                  (CAN_TXBTO_TO1_Msk & ((value) << CAN_TXBTO_TO1_Pos))
#define CAN_TXBTO_TO2_Pos                     _U_(2)                                               /**< (CAN_TXBTO) Transmission Occurred 2 Position */
#define CAN_TXBTO_TO2_Msk                     (_U_(0x1) << CAN_TXBTO_TO2_Pos)                      /**< (CAN_TXBTO) Transmission Occurred 2 Mask */
#define CAN_TXBTO_TO2(value)                  (CAN_TXBTO_TO2_Msk & ((value) << CAN_TXBTO_TO2_Pos))
#define CAN_TXBTO_TO3_Pos                     _U_(3)                                               /**< (CAN_TXBTO) Transmission Occurred 3 Position */
#define CAN_TXBTO_TO3_Msk                     (_U_(0x1) << CAN_TXBTO_TO3_Pos)                      /**< (CAN_TXBTO) Transmission Occurred 3 Mask */
#define CAN_TXBTO_TO3(value)                  (CAN_TXBTO_TO3_Msk & ((value) << CAN_TXBTO_TO3_Pos))
#define CAN_TXBTO_TO4_Pos                     _U_(4)                                               /**< (CAN_TXBTO) Transmission Occurred 4 Position */
#define CAN_TXBTO_TO4_Msk                     (_U_(0x1) << CAN_TXBTO_TO4_Pos)                      /**< (CAN_TXBTO) Transmission Occurred 4 Mask */
#define CAN_TXBTO_TO4(value)                  (CAN_TXBTO_TO4_Msk & ((value) << CAN_TXBTO_TO4_Pos))
#define CAN_TXBTO_TO5_Pos                     _U_(5)                                               /**< (CAN_TXBTO) Transmission Occurred 5 Position */
#define CAN_TXBTO_TO5_Msk                     (_U_(0x1) << CAN_TXBTO_TO5_Pos)                      /**< (CAN_TXBTO) Transmission Occurred 5 Mask */
#define CAN_TXBTO_TO5(value)                  (CAN_TXBTO_TO5_Msk & ((value) << CAN_TXBTO_TO5_Pos))
#define CAN_TXBTO_TO6_Pos                     _U_(6)                                               /**< (CAN_TXBTO) Transmission Occurred 6 Position */
#define CAN_TXBTO_TO6_Msk                     (_U_(0x1) << CAN_TXBTO_TO6_Pos)                      /**< (CAN_TXBTO) Transmission Occurred 6 Mask */
#define CAN_TXBTO_TO6(value)                  (CAN_TXBTO_TO6_Msk & ((value) << CAN_TXBTO_TO6_Pos))
#define CAN_TXBTO_TO7_Pos                     _U_(7)                                               /**< (CAN_TXBTO) Transmission Occurred 7 Position */
#define CAN_TXBTO_TO7_Msk                     (_U_(0x1) << CAN_TXBTO_TO7_Pos)                      /**< (CAN_TXBTO) Transmission Occurred 7 Mask */
#define CAN_TXBTO_TO7(value)                  (CAN_TXBTO_TO7_Msk & ((value) << CAN_TXBTO_TO7_Pos))
#define CAN_TXBTO_TO8_Pos                     _U_(8)                                               /**< (CAN_TXBTO) Transmission Occurred 8 Position */
#define CAN_TXBTO_TO8_Msk                     (_U_(0x1) << CAN_TXBTO_TO8_Pos)                      /**< (CAN_TXBTO) Transmission Occurred 8 Mask */
#define CAN_TXBTO_TO8(value)                  (CAN_TXBTO_TO8_Msk & ((value) << CAN_TXBTO_TO8_Pos))
#define CAN_TXBTO_TO9_Pos                     _U_(9)                                               /**< (CAN_TXBTO) Transmission Occurred 9 Position */
#define CAN_TXBTO_TO9_Msk                     (_U_(0x1) << CAN_TXBTO_TO9_Pos)                      /**< (CAN_TXBTO) Transmission Occurred 9 Mask */
#define CAN_TXBTO_TO9(value)                  (CAN_TXBTO_TO9_Msk & ((value) << CAN_TXBTO_TO9_Pos))
#define CAN_TXBTO_TO10_Pos                    _U_(10)                                              /**< (CAN_TXBTO) Transmission Occurred 10 Position */
#define CAN_TXBTO_TO10_Msk                    (_U_(0x1) << CAN_TXBTO_TO10_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 10 Mask */
#define CAN_TXBTO_TO10(value)                 (CAN_TXBTO_TO10_Msk & ((value) << CAN_TXBTO_TO10_Pos))
#define CAN_TXBTO_TO11_Pos                    _U_(11)                                              /**< (CAN_TXBTO) Transmission Occurred 11 Position */
#define CAN_TXBTO_TO11_Msk                    (_U_(0x1) << CAN_TXBTO_TO11_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 11 Mask */
#define CAN_TXBTO_TO11(value)                 (CAN_TXBTO_TO11_Msk & ((value) << CAN_TXBTO_TO11_Pos))
#define CAN_TXBTO_TO12_Pos                    _U_(12)                                              /**< (CAN_TXBTO) Transmission Occurred 12 Position */
#define CAN_TXBTO_TO12_Msk                    (_U_(0x1) << CAN_TXBTO_TO12_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 12 Mask */
#define CAN_TXBTO_TO12(value)                 (CAN_TXBTO_TO12_Msk & ((value) << CAN_TXBTO_TO12_Pos))
#define CAN_TXBTO_TO13_Pos                    _U_(13)                                              /**< (CAN_TXBTO) Transmission Occurred 13 Position */
#define CAN_TXBTO_TO13_Msk                    (_U_(0x1) << CAN_TXBTO_TO13_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 13 Mask */
#define CAN_TXBTO_TO13(value)                 (CAN_TXBTO_TO13_Msk & ((value) << CAN_TXBTO_TO13_Pos))
#define CAN_TXBTO_TO14_Pos                    _U_(14)                                              /**< (CAN_TXBTO) Transmission Occurred 14 Position */
#define CAN_TXBTO_TO14_Msk                    (_U_(0x1) << CAN_TXBTO_TO14_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 14 Mask */
#define CAN_TXBTO_TO14(value)                 (CAN_TXBTO_TO14_Msk & ((value) << CAN_TXBTO_TO14_Pos))
#define CAN_TXBTO_TO15_Pos                    _U_(15)                                              /**< (CAN_TXBTO) Transmission Occurred 15 Position */
#define CAN_TXBTO_TO15_Msk                    (_U_(0x1) << CAN_TXBTO_TO15_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 15 Mask */
#define CAN_TXBTO_TO15(value)                 (CAN_TXBTO_TO15_Msk & ((value) << CAN_TXBTO_TO15_Pos))
#define CAN_TXBTO_TO16_Pos                    _U_(16)                                              /**< (CAN_TXBTO) Transmission Occurred 16 Position */
#define CAN_TXBTO_TO16_Msk                    (_U_(0x1) << CAN_TXBTO_TO16_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 16 Mask */
#define CAN_TXBTO_TO16(value)                 (CAN_TXBTO_TO16_Msk & ((value) << CAN_TXBTO_TO16_Pos))
#define CAN_TXBTO_TO17_Pos                    _U_(17)                                              /**< (CAN_TXBTO) Transmission Occurred 17 Position */
#define CAN_TXBTO_TO17_Msk                    (_U_(0x1) << CAN_TXBTO_TO17_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 17 Mask */
#define CAN_TXBTO_TO17(value)                 (CAN_TXBTO_TO17_Msk & ((value) << CAN_TXBTO_TO17_Pos))
#define CAN_TXBTO_TO18_Pos                    _U_(18)                                              /**< (CAN_TXBTO) Transmission Occurred 18 Position */
#define CAN_TXBTO_TO18_Msk                    (_U_(0x1) << CAN_TXBTO_TO18_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 18 Mask */
#define CAN_TXBTO_TO18(value)                 (CAN_TXBTO_TO18_Msk & ((value) << CAN_TXBTO_TO18_Pos))
#define CAN_TXBTO_TO19_Pos                    _U_(19)                                              /**< (CAN_TXBTO) Transmission Occurred 19 Position */
#define CAN_TXBTO_TO19_Msk                    (_U_(0x1) << CAN_TXBTO_TO19_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 19 Mask */
#define CAN_TXBTO_TO19(value)                 (CAN_TXBTO_TO19_Msk & ((value) << CAN_TXBTO_TO19_Pos))
#define CAN_TXBTO_TO20_Pos                    _U_(20)                                              /**< (CAN_TXBTO) Transmission Occurred 20 Position */
#define CAN_TXBTO_TO20_Msk                    (_U_(0x1) << CAN_TXBTO_TO20_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 20 Mask */
#define CAN_TXBTO_TO20(value)                 (CAN_TXBTO_TO20_Msk & ((value) << CAN_TXBTO_TO20_Pos))
#define CAN_TXBTO_TO21_Pos                    _U_(21)                                              /**< (CAN_TXBTO) Transmission Occurred 21 Position */
#define CAN_TXBTO_TO21_Msk                    (_U_(0x1) << CAN_TXBTO_TO21_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 21 Mask */
#define CAN_TXBTO_TO21(value)                 (CAN_TXBTO_TO21_Msk & ((value) << CAN_TXBTO_TO21_Pos))
#define CAN_TXBTO_TO22_Pos                    _U_(22)                                              /**< (CAN_TXBTO) Transmission Occurred 22 Position */
#define CAN_TXBTO_TO22_Msk                    (_U_(0x1) << CAN_TXBTO_TO22_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 22 Mask */
#define CAN_TXBTO_TO22(value)                 (CAN_TXBTO_TO22_Msk & ((value) << CAN_TXBTO_TO22_Pos))
#define CAN_TXBTO_TO23_Pos                    _U_(23)                                              /**< (CAN_TXBTO) Transmission Occurred 23 Position */
#define CAN_TXBTO_TO23_Msk                    (_U_(0x1) << CAN_TXBTO_TO23_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 23 Mask */
#define CAN_TXBTO_TO23(value)                 (CAN_TXBTO_TO23_Msk & ((value) << CAN_TXBTO_TO23_Pos))
#define CAN_TXBTO_TO24_Pos                    _U_(24)                                              /**< (CAN_TXBTO) Transmission Occurred 24 Position */
#define CAN_TXBTO_TO24_Msk                    (_U_(0x1) << CAN_TXBTO_TO24_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 24 Mask */
#define CAN_TXBTO_TO24(value)                 (CAN_TXBTO_TO24_Msk & ((value) << CAN_TXBTO_TO24_Pos))
#define CAN_TXBTO_TO25_Pos                    _U_(25)                                              /**< (CAN_TXBTO) Transmission Occurred 25 Position */
#define CAN_TXBTO_TO25_Msk                    (_U_(0x1) << CAN_TXBTO_TO25_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 25 Mask */
#define CAN_TXBTO_TO25(value)                 (CAN_TXBTO_TO25_Msk & ((value) << CAN_TXBTO_TO25_Pos))
#define CAN_TXBTO_TO26_Pos                    _U_(26)                                              /**< (CAN_TXBTO) Transmission Occurred 26 Position */
#define CAN_TXBTO_TO26_Msk                    (_U_(0x1) << CAN_TXBTO_TO26_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 26 Mask */
#define CAN_TXBTO_TO26(value)                 (CAN_TXBTO_TO26_Msk & ((value) << CAN_TXBTO_TO26_Pos))
#define CAN_TXBTO_TO27_Pos                    _U_(27)                                              /**< (CAN_TXBTO) Transmission Occurred 27 Position */
#define CAN_TXBTO_TO27_Msk                    (_U_(0x1) << CAN_TXBTO_TO27_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 27 Mask */
#define CAN_TXBTO_TO27(value)                 (CAN_TXBTO_TO27_Msk & ((value) << CAN_TXBTO_TO27_Pos))
#define CAN_TXBTO_TO28_Pos                    _U_(28)                                              /**< (CAN_TXBTO) Transmission Occurred 28 Position */
#define CAN_TXBTO_TO28_Msk                    (_U_(0x1) << CAN_TXBTO_TO28_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 28 Mask */
#define CAN_TXBTO_TO28(value)                 (CAN_TXBTO_TO28_Msk & ((value) << CAN_TXBTO_TO28_Pos))
#define CAN_TXBTO_TO29_Pos                    _U_(29)                                              /**< (CAN_TXBTO) Transmission Occurred 29 Position */
#define CAN_TXBTO_TO29_Msk                    (_U_(0x1) << CAN_TXBTO_TO29_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 29 Mask */
#define CAN_TXBTO_TO29(value)                 (CAN_TXBTO_TO29_Msk & ((value) << CAN_TXBTO_TO29_Pos))
#define CAN_TXBTO_TO30_Pos                    _U_(30)                                              /**< (CAN_TXBTO) Transmission Occurred 30 Position */
#define CAN_TXBTO_TO30_Msk                    (_U_(0x1) << CAN_TXBTO_TO30_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 30 Mask */
#define CAN_TXBTO_TO30(value)                 (CAN_TXBTO_TO30_Msk & ((value) << CAN_TXBTO_TO30_Pos))
#define CAN_TXBTO_TO31_Pos                    _U_(31)                                              /**< (CAN_TXBTO) Transmission Occurred 31 Position */
#define CAN_TXBTO_TO31_Msk                    (_U_(0x1) << CAN_TXBTO_TO31_Pos)                     /**< (CAN_TXBTO) Transmission Occurred 31 Mask */
#define CAN_TXBTO_TO31(value)                 (CAN_TXBTO_TO31_Msk & ((value) << CAN_TXBTO_TO31_Pos))
#define CAN_TXBTO_Msk                         _U_(0xFFFFFFFF)                                      /**< (CAN_TXBTO) Register Mask  */

